package com.example.medical_req;

import android.os.Bundle;
import android.app.Activity;
import android.app.Application;
import android.content.Intent;
import android.database.Cursor;
import android.view.Menu;
import android.view.View;
import android.widget.Button;
import android.widget.ImageButton;
import android.widget.Toast;

public class MainActivity extends Activity {

	DataHolder holder;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
    

    Button bb1 = (Button) findViewById(R.id.button_Inner);
    bb1.setOnClickListener(new View.OnClickListener() {
		
		@Override
		public void onClick(View VV) {
			System.exit(0);
			// TODO Auto-generated method stub
			
			
		}
	});
    
    Button bb2 = (Button) findViewById(R.id.button_Nerv);
    bb2.setOnClickListener(new View.OnClickListener() {
		
		@Override
		public void onClick(View V) {
		
			int id = 0;
			int d_id = 3;
			String desc = "عمى ألوان";
			
			// insert baljdol al2wl w sh4aaaal
			holder = new DataHolder(getBaseContext());
			holder.open();
			long i =  holder.insertData(0, d_id, "تشوهات الأظافر "," قد يساعد فحص الأظافر في الكشف عن العامل المسبب بسهولة نظرا لقلة الامراض التي قد تظهر نتيجة بتشوه الاظافر");
			i= holder.insertData(1, d_id, "خطوط كيري(خطوط غامقة او بنية على الاظافر) ","تحتاج الى التحاليل الدموية التالية :CBC,وظائف كبد صورة صدر CRD/ESR");
			i= holder.insertData(2, d_id, "احتشاء الطيات الظفرية وتشكل عقد ","احتشاء الطيات الظفرية وتشكل عقد");
	     	i=	holder.insertData(3, d_id, "انحلال الظفر","غالبا يسبب الصداف او فرط نشاط الدرق");
			i= holder.insertData(4, d_id, "تقعر الظفر ","بسبب فقر الدم بعوز الحديد ونادرا بسبب الداء القلبي الاقفاري او الفرنجي");
			i= holder.insertData(5, d_id, "خطوط باو","تكون عبارة عن خطوط عرضية بسبب اي نوع من المرض الشديد ليس لها قيمة تشخيصية");
			i= holder.insertData(6, d_id, "خطوط مويرك ","وهي بسبب نقص الالبومين");
			i= holder.insertData(7, d_id, "الخاصة البقعية او الصداف","الخاصة البقعية او الصداف");
			i= holder.insertData(8, d_id, "اعتلال المفاصل والامها ","اعتلال المفاصل والامها");
			i=holder.insertData(9, d_id, "تشوهات الأظافر ","تشوهات الأظافر ");
			i=holder.insertData(10, d_id, "تشوهات الأظافر ","تشوهات الأظافر ");
			i=holder.insertData(11, d_id, "تشوهات الأظافر ","تشوهات الأظافر ");
		    i=holder.insertData(12, d_id, "تشوهات الأظافر ","تشوهات الأظافر ");
		    i=holder.insertData(13, d_id, "تشوهات الأظافر ","تشوهات الأظافر ");
			 i =  holder.insertData(14, d_id, "صداع","تشوهات الأظافر ");
			 i =  holder.insertData(15, d_id, desc+" الامتت","تشوهات الأظافر ");
			 i =  holder.insertData(16, d_id, desc+" امنتكنةل","تشوهات الأظافر ");
			 i =  holder.insertData(17, d_id, desc+" النتلال","تشوهات الأظافر ");
			
			
			int id2 = 0;
			int r_id = 2;
			String Nam = "  اسم المرض";
			String yk = "ضخامة عقدية قاسية";
			String ys = "الخزعة الاستئصالية";
			String td = "تحديد السبب المستبطن وراء هذه الضخامة و علاجه";
			
			holder = new DataHolder(getBaseContext());
			holder.open();
			long ii =   holder.insertData2(id2++, 0, "الالتهاب الشفا الجرثومي تحت الحاد", ":التعب ,فقد الوزن ,شحوب ,حُمى خفيفة,نفخة قلبية متغيرة مع وجود سوابق لامراض قلبية وسامية او خلقية."+'\n'+"التعداد العام يظهر انخفاض هيموغلوبين ,ارتفاع ببض ,ارتفاع سرعة تثفل مع ارتفاع البروتين الارتكاسي", "زرع دم وعزل الجرثوم  غالبا(العقديات المخضرة) بالاضافة الى رؤوية التنبتات على الشغاف باستخدام الايكو القلبي عبر المري TEE", "يبدأ العلاج عند الاستشباه بالمرض بعد ارسال زروعات الدم الصادات الحيوية المستخدمة  بنبزيل نبسيلي أو جنتاميسبن وريدي                              لمدة اربع اسابيع.");
			ii =  holder.insertData2(id2++, 0, "افات القل الخلقية المزرقة", "وجود قصة مرضية مع زرق مركزية", " ظهور الافة على الايكو القلبي", "أكسجة المريض ,معالجة عرضية لقصور القلب او الانتان في حال وجوده استشارة جراحة قلبية لاجراء التدخل الازم");
			ii =  holder.insertData2(id2++, 0, "الكارسينوما القصبية", "تعب عام سعال متزايد  فقد وزن  نفث دم قصة تدخين (وجود ما يدل على الافة الكتلية ,ذات رئة ,انصباب ب حنبعلى الصورة البسيطة (CHR) أو الطبقي محوري", "تنظير القصبات وخد خزعات", ": تسكين الالم وعلاج الانتانات المرافقة  وتقييم الورم المرحلي على الطقي المحوري لمناقشة الخيارات العلاجية (قابل للاستئصال ,اشعة فقط,معالجة تطبيقية).");
			ii =  holder.insertData2(id2++, 0, "التوسع العصبي ", "سعال مزمن منتبج القشع كثيف لتصبح ذو لون رمادي داكن", "صورة صدر بسيطة (CHR) والطبقي المحوري (CT)(توسع قصبات مع ثخانة  صدر القصبات) تنظير القصبات", "صادات حيوية وفقا لنتائج زرع القشع ,موسعات القصبة مثل السالبوتامول ,سيتروئيدات جهازية,قد نضطر للجراحة.");
			ii =  holder.insertData2(id2++, 0, "خراجات الرئة", "السعال ,حالة عامة سيئة , عرواءات,وجود سوابق مرضية لمرض رئوي مستبطن.", "صورة صرية بسيطة تظهر كتل تحتوي على سائل وهوائ  نوق", "صادات حسب زرع القشع ,بزل الخراجة و صقن الصادات داخلها-التفجير الجراحي.");
			ii =  holder.insertData2(id2++, 0, "الدبيلية او تقيح الجنب", "سعال, حالة عامة سيئة ,حمى,اصمية بالقرع", "ارتفاع بيض على حساب المعادلات,على صورة الصدر البسيطة:تكثف شيدي, قد نلجأ لبزل الجنب ورؤية سائل قيحي", "العلاج بالصادات بزل الجنب");
			ii =  holder.insertData2(id2++, 0, "تشمع الكبد", "يقترح ب وجود قصة مرضي كبدي مثل كحولية شرهة ,سائل حبن,وردة جدار الطن ظاهرة , العنكبوت الوعائي على راحة اليد ,التّثدي عند الذكور", "انخفاض  البومين المصل,اختبارات وظائف الكبد غير الطبيعية ويثبت بخزعة الكبد.", "حمية تقليل الملح ,امتناع عن الكحول,اعطاء فيتامين k التلقيح ضد الانفلونزا والعقديات الرئوية,الكولسيترامين");
			ii =  holder.insertData2(id2++,0 , "داير كرون", "اسهال مدمن مع الم بطني وفقدان وزن.", "ب تطهير هضمي سقلي مع أخد خزعات ,التصوير ب بالظليل بعد رخصة الباريوم", "حس شدة المرض اذا كان خفيف ستيروئيدات فموية اذا كان شديد سيتروئيدات جهازية مع مثطات مناعة مثل: ميثوتركسات وانفلوكستمباتر");
			ii =  holder.insertData2(id2++, 0, "التهاب الكولون الغرصي", ": اسهال مفاجئ متقطع مع دم ومخاط  فقدان وزن", "تنظير كولونات واخد خزعات",  "  فموي ,ميسالازين المرض الخفيف"+'\n'+"اما الشديد :هيدرو كورتيزون وريدي+بريدينزلون فموي +سلفاسلازين وقد نلجأ للجراحة.");
			ii =  holder.insertData2(id2++, 1, "تشمع الكبد", "وجود قصة مرضي كبدي مثل كحولية شرهة ,سائل حبن,وردة جدار الطن ظاهرة , العنكبوت الوعائي على راحة اليد ,التّثدي عند الذكور", "انخفاض  البومين المصل,اختبارات وظائف الكبد غير الطبيعية ويثبت بخزعة الكبد.", "حمية تقليل الملح ,امتناع عن الكحول,اعطاء فيتامين k التلقيح ضد الانفلونزا والعقديات الرئوية,الكولسيترامين");
			ii =  holder.insertData2(id2++, 1, "قصور قلب احتقاني", "يقترح ب :زلة تنفسية جهدية ,زلة اضجاعية ,زلة انتيابية ليلية ,ارتفاع الضغط الوداجي,وذمة محيطية(على الوجه الاماي الانسي للساق) + ايكو قلبي ", "صورة صدرية بسيطة + ايكو قلبي", "البحث عن السبب في هذا القصور و معالجته قبل افات الصمامات ,فقر الدم ,قصور او فرط نشاط الدرق والانتان الصدري ,يجب ايقاف التدخين ,اعطاء مدرات وحاصرات الاكسنتزيم ACEIمع حاصرات بيتا والديجوكسينين");
			ii =  holder.insertData2(id2++, 1, "الداء السكري", ":العطش,السهاف ,تعدد البيلات ,التعب العام ,قصة عائلية ", "اختبار سكر دم صباغي اكثر من 126 ملغ/دل مرة واحدة مع وجود اعراض ", "الحمية السكرية ,تغير نمط الحياة مثل القيام بالتمارين , ايقاف التدخين ,الحمية قليلة الغلكوز. اما العلاج فيختلف من النمط الاول (الانسولين تحت الجلد)او النمط الثاني :خافضات السكر الفموية مثل الميتفورقين.");
			ii =  holder.insertData2(id2++, 1, "وجود ورم في مكان الجسم", ":فقد وزن وقهم وفقد شهية لمدة اشهر +الم عظام ", ": القصة +الفحص الدقيق +صوةر الصدر CBC,ESR والتصوير الشعاعي المتقدم", "");
			ii =  holder.insertData2(id2++, 3, "انحلال الظفر", ": تسمك الظفر وتأطله وانفصاله عن سرير الظفر", "المظهر السريري والبحث عن السبب مثل التغيرات الجلدية الخاص بالصداف او التحاليل الخاص ب فرط نشاط الدرق مثل ft3,ft4,tsh", "");
			ii =  holder.insertData2(id2++, 2, "الذاّب  الجمامي الجهازي", "انتفاخ المفاصل بين السلامية البعيدة DIP وغيرها من المفاصل الكبيرة,طفح الفراصة على الوجنتين,انصباب جنب ,افات جهازية متعددة تجسس للضياء.", "CBC تعداد ووضعيته يظهر انخفاض هيموغلوبين وارتفاع بيض ارتفاع ESR,CRRايجابية اضداد النوى ", "للمرض الخفيف قد نستحدم مضادات الالتهاب غير السيتروئيدية مع السيتروئيدات الموضعية للطفح الجلدي ,الادوية مضادات لألم المفاصل في حال المرض الجهازي والكلوي نعطي سيتروئيدات جهازية +مثبطات المناعة وقد نلجأ لمضادة البلازما.");
			ii =  holder.insertData2(id2++, 2, "التهاب الشفاف الجرثوكي الحاد", "انتفاخ المفاصل بين السلامية البعيدة DIP وغيرها من المفاصل الكبيرة,طفح الفراصة على الوجنتين,انصباب جنب ,افات جهازية متعددة تجسس للضياء", "CBC تعداد ووضعيته يظهر انخفاض هيموغلوبين وارتفاع بيض ارتفاع ESR,CRRايجابية اضداد النوى ", "للمرض الخفيف قد نستحدم مضادات الالتهاب غير السيتروئيدية مع السيتروئيدات الموضعية للطفح الجلدي ,الادوية مضادات لألم المفاصل في حال المرض الجهازي والكلوي نعطي سيتروئيدات جهازية +مثبطات المناعة وقد نلجأ لمضادة البلازما.");
			ii =  holder.insertData2(id2++, 4, "تقعر الظفر", "اظافر بشكل الملعقة", "انخفاض الهيموغلوبين ,انخفاض الغيررتين او تغيرات اقفارية على تخطيط القلب عند مرض داء القلبي الاقفاري او التحاليل الخلوية عند مرض الافرنجي", "لا يوجد");
			ii =  holder.insertData2(id2++, 6, "خطوط مويرك", ":حفر صغيرة على الظفر", "معايرة البومين المصل", "");
			ii =  holder.insertData2(id2++, 7, "الخاصة البقعية او الصداف", "حفر صغيرة على الظفر", "طفح على سطوح الباسطات مع تقشرات لامعة (صداف) او بقع مدورة من فقد الشعر في الحاصة البقعية", "التدبير");
			ii =  holder.insertData2(id2++, 8, "الفصال العظمي المبدئي ", "وجود قصة –توقف طمث –عقد هيبردان(عبارة عن عقد عظمية مزدوجة مؤلمة على المفاصل من السلاميات البعيدة", ": مظهر العقد على صورة اليد البسيطة ", "مسكنات ومضادات التهاب غير ستروئيدية NSADs مع وقاية المعدة باعطاء ادوية قبل الافوميرازول");
			ii =  holder.insertData2(id2++, 8, "التهاب المفاصل الرثياني ", "تورم ونشوة في المفاصل السلامية (غالبا القريبة) مع الانحراف الزندي للرسغ .بالاضافة لتشكيل العقد الرثيانية", "ايجابية العامل الرثياني,مظهر المفاصل المصابة على الصورة البسيطة", "علاج فيزيائي مع مسكنات ومضادات التهاب غير ستروئيدية وقاية المعدة ب الاومبيرازول ,جرعات من البريدفينزولون بالاضافة للادوية المعدلة لسير المرض مثل الميثوتركسات والابنغلوكسيمات");
			ii =  holder.insertData2(id2++, 8, "التهاب المفاصل الصدافي", "تورم وتشوه المفاصل بين السلاميات(غالبا البعيدة) ومظهر المفاصل المصابة على صورة اليدد البسيطة x-ray", "طفح جاف مع تقشرات جلدية لماعة بلون فضي خاصة على جلد الباسطات", "مضادات التهاب غيرستروئيدية حماية المعدة  ادوية معدلة لسير المرض مثل ميثوتركسات,ليفلونومايد,انفلوكسيماب");
			ii =  holder.insertData2(id2++, 8, "الذأب الجمامي الجهازي", "تورم او نشوة المفاصل بين السلاميات جميعها طفح الفراشة علامات انصباب جنب او تامور,خلل في وظيفة الكلية", "ايجابية اضداد النوى ANA واضداد ال دنا des DNA", ":مضادات التهاب غير سيتروئيدية للمرض الخفيف ,واقي شمسي وستروئيد موضعي موضع الطفح مضادات الملاريا للاصابة المفصلية سيتروئيدات او مثبطات مناعة للمرض الجهازي الكلوي");
			ii =  holder.insertData2(id2++, 2, "اسم المرض", "يقترح", "يثبت", "التدبير");
			ii =  holder.insertData2(id2++, 2, "اسم المرض", "يقترح", "يثبت", "التدبير");
			ii =  holder.insertData2(id2++, 2, "اسم المرض", "يقترح", "يثبت", "التدبير");
			ii =  holder.insertData2(id2++, 2, "اسم المرض", "يقترح", "يثبت", "التدبير");
			ii =  holder.insertData2(id2++, 2, "اسم المرض", "يقترح", "يثبت", "التدبير");
			ii =  holder.insertData2(id2++, 2, "اسم المرض", "يقترح", "يثبت", "التدبير");
			ii =  holder.insertData2(id2++, 2, "اسم المرض", "يقترح", "يثبت", "التدبير");
			ii =  holder.insertData2(id2++, 2, "اسم المرض", "يقترح", "يثبت", "التدبير");
			ii =  holder.insertData2(id2++, 2, "اسم المرض", "يقترح", "يثبت", "التدبير");
			
			ii =  holder.insertData2(id2++, r_id, Nam+"بتن", yk, ys, td);
			ii =  holder.insertData2(id2++, r_id, Nam+"بفع", yk, ys, td);
			ii =  holder.insertData2(id2++, r_id, Nam+"بب", yk, ys, td);
			
			holder.close();
			Intent enterr = new Intent(V.getContext(),departments.class );
			startActivity(enterr);
			
			Toast.makeText(getBaseContext(), "أهلا و سهلا ", Toast.LENGTH_LONG).show();
			
		}
	});
    
    
    }
    
    

    @Override
    public boolean onCreateOptionsMenu(Menu menu) {
        // Inflate the menu; this adds items to the action bar if it is present.
        getMenuInflater().inflate(R.menu.main, menu);
        return true;
    }
    
}
